_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 11)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 117, 128)          17024     
_________________________________________________________________
dropout (Dropout)            (None, 117, 128)          0         
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 58, 128)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 54, 128)           82048     
_________________________________________________________________
dropout_1 (Dropout)          (None, 54, 128)           0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 27, 128)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 23, 128)           82048     
_________________________________________________________________
dropout_2 (Dropout)          (None, 23, 128)           0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 11, 128)           0         
_________________________________________________________________
bidirectional (Bidirectional (None, 11, 128)           98816     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 11, 128)           98816     
_________________________________________________________________
bidirectional_2 (Bidirection (None, 11, 128)           98816     
_________________________________________________________________
bidirectional_3 (Bidirection (None, 128)               98816     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 3)                 387       
=================================================================
Total params: 576,771
Trainable params: 576,771
Non-trainable params: 0
_________________________________________________________________
