_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 11)]         0         
_________________________________________________________________
bidirectional (Bidirectional (None, 128, 22)           2024      
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128, 22)           2992      
_________________________________________________________________
bidirectional_2 (Bidirection (None, 128, 22)           2992      
_________________________________________________________________
bidirectional_3 (Bidirection (None, 128, 22)           2992      
_________________________________________________________________
dropout (Dropout)            (None, 128, 22)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 128, 128)          33920     
_________________________________________________________________
dropout_1 (Dropout)          (None, 128, 128)          0         
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 64, 128)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 64, 128)           82048     
_________________________________________________________________
dropout_2 (Dropout)          (None, 64, 128)           0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 32, 128)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 32, 128)           82048     
_________________________________________________________________
dropout_3 (Dropout)          (None, 32, 128)           0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 16, 128)           0         
_________________________________________________________________
bidirectional_4 (Bidirection (None, 22)                12320     
_________________________________________________________________
dense (Dense)                (None, 3)                 69        
=================================================================
Total params: 221,405
Trainable params: 221,405
Non-trainable params: 0
_________________________________________________________________
