_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 11)]         0         
_________________________________________________________________
lstm (LSTM)                  (None, 128, 11)           1012      
_________________________________________________________________
lstm_1 (LSTM)                (None, 128, 11)           1012      
_________________________________________________________________
lstm_2 (LSTM)                (None, 11)                1012      
_________________________________________________________________
dense (Dense)                (None, 3)                 36        
=================================================================
Total params: 3,072
Trainable params: 3,072
Non-trainable params: 0
_________________________________________________________________
