_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 11)]         0         
_________________________________________________________________
lstm (LSTM)                  (None, 11)                1012      
_________________________________________________________________
dense (Dense)                (None, 3)                 36        
=================================================================
Total params: 1,048
Trainable params: 1,048
Non-trainable params: 0
_________________________________________________________________
