_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 11)]         0         
_________________________________________________________________
tcn (TCN)                    (None, 128)               1307904   
_________________________________________________________________
dense (Dense)                (None, 3)                 387       
=================================================================
Total params: 1,308,291
Trainable params: 1,298,051
Non-trainable params: 10,240
_________________________________________________________________
